dhylands/sensorweb-nrf51822/main.c
    printf("\033[2J\033[;HCharacteristic Tutorial, Completed Code\r\n");

    // Initialize.
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    device_manager_init(erase_bonds);
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

#if 0
    static uint8_t const aes_secret[16] = {
        0xde, 0x9e, 0xdb, 0x7d, 0x7b, 0x7d, 0xc1, 0xb4,
        0xd3, 0x5b, 0x61, 0xc2, 0xec, 0xe4, 0x35, 0x37,
    };

    static char const msg[16] = "This is a test.";

    nrf_ecb_hal_data_t ecb;

    memcpy(ecb.key, aes_secret, sizeof(ecb.key));
    memcpy(ecb.cleartext, msg, sizeof(ecb.cleartext));
    memset(ecb.ciphertext, 0, sizeof(ecb.ciphertext));

    err_code = sd_ecb_block_encrypt(&ecb);
    printf("sd_ecb_block_encrypt returned %lu\r\n", err_code);

    printhex("aes secret", ecb.key, sizeof(ecb.key));
    printhex(" cleartext", ecb.cleartext, sizeof(ecb.cleartext));
    printhex("ciphertext", ecb.ciphertext, sizeof(ecb.ciphertext));

    memcpy(ecb.cleartext, ecb.ciphertext, sizeof(ecb.cleartext));
    memset(ecb.ciphertext, 0, sizeof(ecb.ciphertext));

    err_code = sd_ecb_block_encrypt(&ecb);
    printf("sd_ecb_block_encrypt returned %lu\r\n", err_code);

    printhex("aes secret", ecb.key, sizeof(ecb.key));
    printhex(" cleartext", ecb.cleartext, sizeof(ecb.cleartext));
    printhex("ciphertext", ecb.ciphertext, sizeof(ecb.ciphertext));

    //nrf_delay_ms(1000);
#endif

#if 0
    // Start the random number generator.  We don't initialise a noise
    // source here because we don't need one for testing purposes.
    // Real applications should of course use a proper noise source.
    RNG.begin("TestBLE 1.0", 950);

#if 1
    uint8_t servicePrivateKey[32] = {0x68, 0xD6, 0x31, 0x9D, 0xE5, 0x0E, 0xE1, 0x08,
                                     0x33, 0x20, 0xC8, 0xFC, 0x1E, 0x1E, 0xB1, 0x8E,
                                     0x54, 0x4C, 0x80, 0x87, 0x24, 0x03, 0xE7, 0x43,
                                     0x72, 0xC0, 0x49, 0x2F, 0xDD, 0xF8, 0x75, 0x43};

    uint8_t servicePublicKey[32]  = {0xD9, 0x2D, 0x7A, 0x3F, 0xEE, 0x2F, 0x67, 0x5F,
                                     0x47, 0x5F, 0xC4, 0x52, 0xA6, 0x81, 0xA9, 0x25,
                                     0x5C, 0x21, 0x50, 0x55, 0x37, 0x02, 0xE5, 0xF1,
                                     0x27, 0xD8, 0x37, 0x62, 0x3D, 0x4C, 0x81, 0x35};
#else
    uint8_t servicePrivateKey[32];
    uint8_t servicePublicKey[32];

    Curve25519::dh1(servicePublicKey, servicePrivateKey);
#endif

    printhex("Service Private Key", servicePrivateKey, 32);
    printhex("Service Public  Key", servicePublicKey, 32);

#if 1
    uint8_t clientPrivateKey[32] = {0xC0, 0xA9, 0xB3, 0x04, 0xB1, 0xFB, 0x77, 0xCC,
                                    0xA7, 0xFB, 0xD3, 0xD8, 0x8D, 0x0D, 0x1A, 0xB2,
                                    0x7D, 0xFA, 0x2D, 0x53, 0xD9, 0x03, 0x29, 0x78,
                                    0x25, 0x8C, 0x81, 0x77, 0x2C, 0xB4, 0x7E, 0x49};

    uint8_t clientPublicKey[32]  = {0x5C, 0xFF, 0xD4, 0xB3, 0xE8, 0x39, 0x1E, 0x6E,
                                    0xC6, 0x30, 0x70, 0xC1, 0xA5, 0x5C, 0xB2, 0x82,
                                    0xBD, 0x6E, 0x3C, 0x7D, 0x28, 0xBF, 0xA2, 0x7B,
                                    0x09, 0x5E, 0xE6, 0x9E, 0xA4, 0x26, 0xB2, 0x6D};
#else
    uint8_t clientPrivateKey[32];
    uint8_t clientPublicKey[32];

    Curve25519::dh1(clientPublicKey, clientPrivateKey);
#endif
    nrf_delay_ms(1000);

    printhex("Client  Private Key", clientPrivateKey, 32);
    printhex("Client  Public  Key", clientPublicKey, 32);

    uint8_t serviceSharedSecret[32];
    uint8_t clientSharedSecret[32];

    memcpy(clientSharedSecret, clientPublicKey, sizeof(clientSharedSecret));
    Curve25519::dh2(clientSharedSecret, servicePrivateKey);

    memcpy(serviceSharedSecret, servicePublicKey, sizeof(serviceSharedSecret));
    Curve25519::dh2(serviceSharedSecret, clientPrivateKey);

    printhex("Client  Shared Secret", clientSharedSecret, 32);
    printhex("Service Shared Secret", serviceSharedSecret, 32);

    uint8_t ssid[32];
    uint8_t password[64];

    //RNG.rand(ssid, sizeof(ssid));
    //RNG.rand(password, sizeof(password));

    memset(ssid, 0xAA, sizeof(ssid));
    strcpy((char *)ssid, "My-SSID");
    memset(password, 0xAA, sizeof(password));
    strcpy((char *)password, "password");

    AES128 aes128;

    aes128.setKey(clientSharedSecret, 16);

    uint8_t ssid_enc[32];
    uint8_t password_enc[32];
    aes128.encryptBlock(ssid_enc, ssid);
    aes128.encryptBlock(password_enc, password);

    uint8_t ssid_dec[32];
    uint8_t password_dec[32];
#if 1
    aes128_decrypt(clientSharedSecret, ssid_dec, ssid_enc, 16);
    aes128_decrypt(clientSharedSecret, password_dec, password_enc, 16);
#else
    aes128.decryptBlock(ssid_dec, ssid_enc);
    aes128.decryptBlock(password_dec, password_enc);
#endif

    printhex("SSID org", ssid, 16);
    printhex("SSID dec", ssid_dec, 16);
    printhex("SSID enc", ssid_enc, 16);
    
    printhex("password org", password, 16);
    printhex("password dec", password_dec, 16);
    printhex("password enc", password_enc, 16);

    printf("SSID = '%s' password = '%s'\r\n", (const char *)ssid_dec, (const char *)password_dec);
#endif


    // Start execution.
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}

/**
 * @}
 */
